/**
 ******************************************************************************
  * @file       hal_dht11.h
  * @author     yearnext
  * @version    1.0.0
  * @date       2016年9月17日
  * @brief      DHT11 驱动头文件
  * @par        工作平台                                  
  *                  CC2530
  * @par        工作频率                                  
  *                  32MHz
  * @par        编译平台									                         
  * 				 IAR
 ******************************************************************************
  * @note
  * 1.XXXXX                  						                      
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __HAL_DHT11_H__
#define __HAL_DHT11_H__

/* Includes ------------------------------------------------------------------*/
#include "comdef.h"

/* Exported macro ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
// 读取温湿度数据类型
#define READ_DHT11_TEMP (1)
#define READ_DHT11_HUM  (2)

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
    uint8 temp;
    uint8 hum;
}DHT11_DATA_t;

/* Private variables ---------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
extern void hal_dht11_init( void );
extern DHT11_DATA_t dht11_rd_data( void );

#endif      /* __HAL_DHT11_H__ */

/**********************************END OF FILE*********************************/
