/**
 ******************************************************************************
  * @file       mcu_adc.h
  * @author     yearnext
  * @version    1.0.0
  * @date       2016年9月17日
  * @brief      CC2530 ADC配置头文件
  * @par        工作平台                                  
  *                  CC2530
  * @par        工作频率                                  
  *                  32MHz
  * @par        编译平台									                          
  * 				 IAR
 ******************************************************************************
  * @note
  * 1.XXXXX                  						                      
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __CC2530_MCU_ADC_H__
#define __CC2530_MCU_ADC_H__

/* Includes ------------------------------------------------------------------*/
#include "comdef.h"
#include <ioCC2530.h>
#include "hal_mcu.h"

/* Exported macro ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private typedef -----------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
extern bool Rd_ADC_Data(uint16*, uint8);
extern void bsp_adc_init(uint8);
extern void bsp_adc_deinit(uint8);
extern void bsp_adc_signal_start(uint8, uint8, uint8);

#endif      /* __CC2530_MCU_ADC_H__ */

/**********************************END OF FILE*********************************/
